Repository: NGI-TRUSTCHAIN/DUME
Catalog: TheiaVision_App/lib/controller/l10n/app_*.arb
Languages: pt

source: Provider Text
pt: Texto do provider

source: Change Provider Text
pt: Mudar o texto do Provider

source: Save
pt: Guardar

# test_page_title
source: Test Page
pt: Página de test

source: Language
pt: Idioma

source: Network Request
pt: Pedido à network

source: Request
pt: Pedido

source: Schedule Network Request
pt: Criar pedido à network

source: Notification
pt: Notificação

source: Create
pt: Criar

source: Street Viewer
pt: Visualização da Rua

source: See PDF
pt: Ver PDF

# password_form_label
source: Password
pt: Palavra-passe

# welcome_text
source: WELCOME!
pt: BEM-VINDO!

# forgot_password
source: Did you forget your password?
pt: Esqueceu-se da sua palavra-passe?

# no_account
source: Don't have an account?
pt: Não tem uma conta?

# create_account_title
source: CREATE AN ACCOUNT
pt: REGISTO

# name_form_label
source: Name
pt: Nome

# confirm_password_form_label
source: Confirm Password
pt: Confirmar Palavra-passe

# register_button
source: REGISTER
pt: REGISTAR

# already_have_account
source: Already have an account?
pt: Já tem uma conta?

source: *Mandatory fields
pt: *Campos de preenchimento obrigatório

# today_option
source: Today
pt: Hoje

# week_option
source: Week
pt: Semana

# month_option
source: Month
pt: Mês

# see_more_button
source: See more
pt: Ver detalhes

source: Tasks
pt: Tarefas

# type_of_event
source: Type of Occurrence
pt: Tipo de Ocorrência

source: Localization
pt: Localização

source: Objectives of the week
pt: Objetivos da semana

source: Notifications
pt: Notificações

source: Videos
pt: Vídeos

source: Camera
pt: Câmara

source: Occurrences
pt: Ocorrências

source: Occurrence
pt: Ocorrência

source: Map
pt: Mapa

source: Homepage
pt: Início

source: Origin
pt: Origem

source: Date
pt: Data

source: Upload State
pt: Estado de Upload

source: All
pt: {Todos, select, male{Todos} female{Todas} other{Todos}}

source: Complete
pt: Completo

source: Error
pt: Erro

source: Waiting
pt: À Espera

source: To
pt: A

source: From
pt: De

# nNotificationsToday
source: {count, plural, =0{You have no new notifications today.} =1{You have 1 new notification today.} other{You have {count} new notifications today.}}
pt: {count, plural, =0{Não tem notificações novas hoje.} =1{Tem 1 nova notificação hoje.} other{Tem {count} notificações novas hoje.}}

# hello
source: Hello, {userName}!
pt: Olá, {userName}!

source: My Packages
pt: Os meus pacotes

# events_package
source: Occurrences
pt: Ocorrências

# images_package
source: Images
pt: Imagens

source: Change Password
pt: Mudar Palavra-passe

source: Log out
pt: Terminar sessão

source: User
pt: Utilizador

source: Invoiced on
pt: Faturado em

source: Type
pt: Tipo

source: Unknown
pt: Desconhecido

source: State
pt: Estado

# occurrence_state
source: {state, select, submitted{Submitted} submittedForManualConfirmation{Submitted For Manual Confirmation} confirmed{Confirmed} unconfirmed{Unconfirmed} definitelyUnconfirmed{Definitely Unconfirmed} resolved{Resolved} inRevision{In Revision} other{Error}}
pt: {state, select, submitted{Submetida} submittedForManualConfirmation{Submetida para Confirmação Manual} confirmed{Confirmada} unconfirmed{Não Confirmada} definitelyUnconfirmed{Rejeitada} resolved{Resolvida} inRevision{Em Revisão} other{Error}}

source: Submitted
pt: Submetida

source: Submitted For Manual Confirmation
pt: Submetida para Confirmação Manual

source: Confirmed
pt: Confirmada

source: Unconfirmed
pt: Não Confirmada

source: Definitely Unconfirmed
pt: Rejeitada

source: Resolved
pt: Resolvida

source: In Revision
pt: Em Revisão

# warning_pop_up
source: Warning
pt: Atenção

# occurrence_type
source: {type, select, graffiti{Graffiti} cardboard{Cardboard} trash{Trash} other{Unkown}}
pt: {type, select, graffiti{Graffiti} cardboard{Cartão} trash{Lixo} other{Desconhecido}}

source: Cardboard
pt: Cartão

source: Trash
pt: Lixo

# ram_warning
source: This recording method consumes a considerable amount of resources, which may result in unsatisfactory performance on lower-end mobile devices. Would you like to continue?
pt: Este método de gravação consome uma quantidade considerável de recursos, o que pode resultar num desempenho insatisfatório em dispositivos móveis de gama mais baixa. Deseja continuar?

# continue_word
source: Continue
pt: Continuar

source: Cancel
pt: Cancelar

# low_space_pop_up
source: Low Space
pt: Pouco Espaço

# low_space_warning
source: It's not possible to record more images due to insufficient memory. Free up space or stay connected to the internet to upload the images currently stored to the server.
pt: Não é possível gravar mais imagens devido à falta de memória. Liberte espaço ou mantenha-se conectado à internet para carregar as imagens atualmente armazenadas para o servidor.

# choose_lang
source: Choose a language
pt: Escolha um idioma

# recover_pass
source: Recover Password
pt: Recuperar Palavra-passe

source: Confirm
pt: Confirmar

source: Delete Account
pt: Eliminar Conta

source: Delete
pt: Eliminar

# delete_text
source: Are you sure you want to delete your account? This action will lead to your account being permanently lost.
pt: Tem a certeza que quer eliminar a sua conta? Esta ação vai levar a que a sua conta seja permanentemente perdida.

source: Change Email
pt: Alterar Email

# change_email_text
source: Are you sure you want to change your email? You will need to confirm your new email before this change takes effect.
pt: Tem a certeza que quer alterar o seu email? Para esta mudança ocorrer terá de primeiro confirmar o seu novo email.

source: Settings
pt: Configurações

source: Upload Settings
pt: Definições de Upload

source: Portuguese
pt: Português

source: English
pt: Inglês

# wifi_data
source: Wifi + Mobile Data
pt: Wifi + Dados Móveis

# no_items
source: No {item} were found.
pt: Não existem {item} para mostrar.

# error_items
source: There was an unexpected error while trying to load the {item}. Please try again.
pt: Houve um erro inesperador ao tentar carregar {item}. Por favor tente novamente.

# notif_new
source: New
pt: Novas

# notif_old
source: Old
pt: Velhas

# notif_state
source: State
pt: Estado

# notif_type
source: Type
pt: Tipo

source: Annotate
pt: Anotar

# notif_type_video
source: Videos
pt: Vídeos

# notif_type_occurrence
source: Occurrences
pt: Ocorrências

# notif_type_other
source: Others
pt: Outras

# notif_type_updates
source: Updates
pt: Atualizações

# notif_type_packages
source: Packages
pt: Pacotes

# notif_type_image
source: Images
pt: Imagens

# image
source: Photo
pt: Foto

# new_video
source: A new video has been added to the queue. Please reload the page to view it.
pt: Um novo vídeo foi adicionado à fila. Por favor, recarregue a página para vê-lo.

# sync_video
source: The video has been synced with the server.
pt: O vídeo foi sincronizado com o servidor.

# see_map
source: See in the map
pt: Ver no mapa

source: Delete Video
pt: Apagar Vídeo

# local_video_delete
source: This video only exists on your device and will be uploaded to the server soon. Deleting it will make it disappear permanently. Are you sure you want to continue?
pt: Este vídeo só existe no seu dispositivo e será enviado para o servidor em breve. Eliminá-lo vai fazê-lo desaparecer permanentemente. Tem a certeza de que quer continuar?

# server_video_delete
source: Are you sure you want to permanently delete this video?
pt: Tem a certeza que quer eliminar este vídeo permanentemente?

# delete_success
source: The video was deleted successfully
pt: O vídeo foi apagado com sucesso

# error_uploading
source: Error: The video is already being uploaded to the server. Please refresh.
pt: Erro: O vídeo já está a ser enviado para o servidor. Por favor, recarregue a página.

# error_uploaded
source: Error: The video has already been uploaded. Please refresh.
pt: Erro: O vídeo já foi enviado. Por favor, recarregue a página.

source: No images available
pt: Sem imagens disponiveis

# frame_in_server
source: Images in the server
pt: Imagens no servidor

# events
source: Occurrences
pt: Ocorrências

# no_events_available
source: This video does not have occurrences
pt: Este vídeo não tem ocorrências

source: Distance Travelled
pt: Distancia Percorrida

source: Start Date
pt: Data de Início

source: End Date
pt: Data de Fim

# change_password_text
source: To request a password change please introduce your current password. You will receive an email after to change your password.
pt: Para solicitar uma alteração de palavra-passe, por favor, insira a sua palavra-passe atual. Você receberá um e-mail posteriormente para alterar a sua palavra-passe.

# email_sent
source: The email was sent
pt: O email foi enviado

source: All fields must be filled
pt: Todos os campos devem ser preenchidos.

# email_field_must_not_be_empty
source: Email field must be filled
pt: O campo de email deve ser preenchido.

# new_email_dif_old_email
source: The new email cannot be the same as the old one.
pt: O novo email não pode ser igual ao antigo.

# new_email_received
source: You have received an email at your new email address. Please confirm it before proceeding.
pt: Recebeu um email no seu novo endereço de email. Por favor, confirme-o antes de prosseguir.

# account_deleted_success
source: Account deleted successfully
pt: Conta eliminada com sucesso.

# name_cannot_be_empty
source: The name cannot be empty
pt: O nome não pode estar vazio

# new_name_not_equal_to_old
source: The new name must not be equal to the old one
pt: O novo nome não pode ser igual ao antigo

# name_changed_success
source: The name was changed successfully.
pt: O nome foi alterado com sucesso.

# picture_changed_success
source: Picture changed successfully
pt: Imagem alterada com sucesso.

source: All fields except name must be filled
pt: Todos os campos exceto o nome devem ser preenchidos

source: Password does not match
pt: A palavra-passe não corresponde

# password_requirements
source: Password must have at least 6 characters, 1 number, 1 letter, and 1 special character
pt: A palavra-passe deve ter pelo menos 6 caracteres, 1 número, 1 letra e 1 caractere especial

# coming_soon_title
source: Coming soon!
pt: Em breve!

# coming_soon_message
source: This app is still in development with features still being added so this page still isn't available.
pt: Esta aplicação ainda está em desenvolvimento e novos recursos ainda estão a ser adicionados. Por isso, esta página ainda não está disponível.

# other_images_button
source: View other images of the location
pt: Ver outras imagens do local

# under_revision_button
source: Put under revision
pt: Colocar sob revisão

# view_video_button
source: View full video
pt: Ver vídeo completo

# edit_annotations_button
source: Edit Annotation
pt: Editar Anotação

# manual_confirmation_button
source: Request Manual Confirmation
pt: Pedir Confirmação Manual

# mark_as_solved_button
source: Mark as Solved
pt: Marcar como Resolvido

# clear_all_button
source: Clear all
pt: Limpar tudo

# login_successful_toast
source: Login Successful
pt: Login bem sucedido

source: No new notifications
pt: Sem novas notificações

# video_text
source: Video
pt: Vídeo

# scheduled_video_upload_notification_title
source: Scheduled Video Upload
pt: Upload de Vídeo Agendado

# scheduled_video_upload_notification_message
source: 📗 The Upload of the Video with ID {videoId} was scheduled.
pt: 📗 O upload do vídeo com ID {videoId} foi agendado.

# video_uploading_notification_title
source: Video is Uploading
pt: O Vídeo está a ser carregado

# video_uploading_notification_message
source: 📗 The Video with ID {videoId} is being uploaded.
pt: 📗 O Vídeo com ID {videoId} estar a ser carregado para o servidor.

# scheduled_image_upload_notification_title
source: Scheduled Picture Upload
pt: Upload de Fotografia Agendado

# scheduled_image_upload_notification_message
source: 📗 The Upload of the Picture with ID {videoId} was scheduled.
pt: 📗 O upload da Fotografia com ID {videoId} foi agendado.

# image_uploading_notification_title
source: Picture is Uploading
pt: A Fotografia está a ser carregada

# image_uploading_notification_message
source: 📗 The Picture with ID {videoId} is being uploaded.
pt: 📗 A Fotografia com ID {videoId} estar a ser carregada para o servidor.

# no_frames
source: The Video has no frames. Cannot save
pt: O Vídeo não tem images. Não é possível guardá-lo.

# video_uploaded_notification_title
source: Video Uploaded
pt: O Vídeo foi carregado

# video_uploaded_notification_message
source: 📗 The Video with ID {videoId} was uploaded successfully.
pt: 📗 O Vídeo com ID {videoId} foi carregado para o servidor com sucesso.

# image_uploaded_notification_title
source: Picture Uploaded
pt: A Fotografia foi carregada

# image_uploaded_notification_message
source: 📗 The Picture with ID {videoId} was uploaded successfully.
pt: 📗 A Fotografia com ID {videoId} foi carregada para o servidor com sucesso.

source: Preparing video upload
pt: A preparar o vídeo para enviar

# cannot_leave_while_recording_toast
source: Cannot leave current screen while recording.
pt: Não é possível sair do ecrã atual enquanto estiver a gravar.

# connection_error_message
source: Connection failed. Please make sure you are connected to the internet. Meanwhile, only offline content will be shown.
pt: Falha na conexão. Por favor, verifique se está conectado à internet. Enquanto isso, apenas o conteúdo offline será exibido.

# connection_timeout_message
source: Connection timed out. You might have a connection problem or the server might be unavailable at the moment. Please retry later.
pt: Tempo de conexão esgotado. Você pode ter um problema de conexão ou o servidor pode estar indisponível no momento. Por favor, tente novamente mais tarde.

# unexpected_error_message
source: An unexpected error has occurred. Please retry later.
pt: Ocorreu um erro inesperado. Por favor, tente novamente mais tarde.

# session_expired_toast
source: Your session expired.
pt: A sua sessão expirou.

source: Packages
pt: Pacotes

# no_account_login
source: There is no account registered with this email
pt: Não existe uma conta registada com este email

# wrong_password_login
source: Email and password do not match
pt: O email e a palavra passe não correspondem

# account_not_activated_login
source: Activate this account in your email before logging in.
pt: Ativa esta conta no teu email antes de fazer login.

# not_a_valid_email
source: The email is not valid
pt: O email não é válido

# account_already_exists
source: An account with this email already exists
pt: Uma conta com este email já existe.

# api_change_settings
source: Where do you want to store your data?
pt: Onde deseja guardar os seus dados?

# solid_api
source: Use Solid
pt: Usar Solid

# theia_api
source: Use Theia
pt: Usar Theia

# solid_popup_info
source: If you want to secure your data and access it from other devices, you should use Solid.
pt: Se pretende proteger os seus dados e aceder-lhes a partir de outros dispositivos, deve utilizar o Solid Protocol.

# theia_popup_info
source: If you only want to try the app or you don't want to synchronize with other devices, you should use Theia.
pt: Se só quiser experimentar a aplicação ou não quiser sincronizar com outros dispositivos, deve utilizar o Theia.

# close_popup
source: Close
pt: Fechar

# pod_account_popup
source: Add or Create your POD
pt: Crie ou adicione o seu POD

# pod_account_popup_text
source: To set up your data POD, you need to create one if you don't already have one or add an existing one.
pt: Para configurar o seu data POD, caso ainda não possua um, necessita de o criar. Caso já possua o seu pode-o adicionar.

# create_pod_account
source: Create
pt: Criar

# add_pod_account
source: Add
pt: Adicionar

# create_pod_form
source: Please fill the fields to create your POD
pt: Preencha os campos para criar o seu POD

# add_pod_form
source: Please fill the fields to add your POD
pt: Preencha os campos para adicionar o seu POD

# pic_video
source: Pictures are considered videos with a single image
pt: Fotografias são consideradas vídeos com apenas uma imagem

# videos_info
source: Videos are any images captured by you including pictures which are considered single image videos
pt: Vídeos são todas as imagens capturadas por si incluindo fotos, que são consideradas vídeos com apenas uma imagem

# occurrences_info
source: Occurrences are urban issues identified in videos
pt: Ocorrências são problemas urbanos identificados em vídeos

source: Turn on
pt: Ativar

# location_services_disabled
source: Location services are disabled.
pt: Os serviços de localização estão desativados.

# turn_on_location_for_videos
source: You must turn on location services to record videos or take pictures.
pt: Tem de ativar os serviços de localização para gravar vídeos ou tirar fotografias.

# no_permission_access_location
source: The app does not have permission to access location services.
pt: A aplicação não tem permissão para aceder aos serviços de localização.

# allow_location_for_videos
source: You must allow the app to use location services to record videos or take pictures.
pt: Tem de permitir que a aplicação utilize os serviços de localização para gravar vídeos ou tirar fotografias.
